app/Controllers/DashboardLaporanController.php

    public function index(): string
    {
        // Mengambil data dari model dengan JOIN
        $pengirimanModel = new PengirimanModel();
        $customerModel = new CustomerModel();
        $destinasiModel = new DestinasiModel();

        $data['destinasi'] = $pengirimanModel
            ->select('pengiriman.destinasi_id, destinasi.destinasi_name, COUNT(*) as jumlah_pengiriman')
            ->join('destinasi', 'destinasi.destinasi_id = pengiriman.destinasi_id')
            ->groupBy('pengiriman.destinasi_id')
            ->get()
            ->getResultArray();

        $data['pengiriman_detail'] = $pengirimanModel
            ->select('customer.customer_name, destinasi.destinasi_name, pengiriman.biaya_pengiriman, pengiriman.tanggal, pengiriman.tanggal_sampai, COUNT(*) as jumlah_pengiriman')
            ->join('customer', 'customer.customer_id = pengiriman.customer_id')
            ->join('destinasi', 'destinasi.destinasi_id = pengiriman.destinasi_id')
            ->groupBy('customer.customer_name, destinasi.destinasi_name, pengiriman.biaya_pengiriman, pengiriman.tanggal_sampai')
            ->get()
            ->getResultArray();
---
SELECT `pengiriman`.`destinasi_id`, `destinasi`.`destinasi_name`, COUNT(*) as jumlah_pengiriman
FROM `pengiriman`
JOIN `destinasi` ON `destinasi`.`destinasi_id` = `pengiriman`.`destinasi_id`
GROUP BY `pengiriman`.`destinasi_id`
SELECT `customer`.`customer_name`, `destinasi`.`destinasi_name`, `pengiriman`.`biaya_pengiriman`, `pengiriman`.`tanggal`, `pengiriman`.`tanggal_sampai`, COUNT(*) as jumlah_pengiriman
FROM `pengiriman`
JOIN `customer` ON `customer`.`customer_id` = `pengiriman`.`customer_id`
JOIN `destinasi` ON `destinasi`.`destinasi_id` = `pengiriman`.`destinasi_id`
GROUP BY `customer`.`customer_name`, `destinasi`.`destinasi_name`, `pengiriman`.`biaya_pengiriman`, `pengiriman`.`tanggal_sampai`

    public function detailData($id)
    {
        $pengirimanModel = new PengirimanModel();

        $data['pengiriman_detail'] = $pengirimanModel
            ->select('customer.customer_name, destinasi.destinasi_name, pengiriman.biaya_pengiriman, pengiriman.tanggal, pengiriman.tanggal_sampai, COUNT(*) as jumlah_pengiriman')
            ->join('customer', 'customer.customer_id = pengiriman.customer_id')
            ->join('destinasi', 'destinasi.destinasi_id = pengiriman.destinasi_id')
            ->where('pengiriman.tanggal', $id)
            ->groupBy('customer.customer_name, destinasi.destinasi_name, pengiriman.biaya_pengiriman, pengiriman.tanggal, pengiriman.tanggal_sampai')
            ->get()
            ->getResultArray();
---
SELECT `customer`.`customer_name`, `destinasi`.`destinasi_name`, `pengiriman`.`biaya_pengiriman`, `pengiriman`.`tanggal`, `pengiriman`.`tanggal_sampai`, COUNT(*) as jumlah_pengiriman
FROM `pengiriman`
JOIN `customer` ON `customer`.`customer_id` = `pengiriman`.`customer_id`
JOIN `destinasi` ON `destinasi`.`destinasi_id` = `pengiriman`.`destinasi_id`
WHERE `pengiriman`.`tanggal` >= '2024-01-19'
AND `pengiriman`.`tanggal_sampai` <= '2024-01-16'
GROUP BY `customer`.`customer_name`, `destinasi`.`destinasi_name`, `pengiriman`.`biaya_pengiriman`, `pengiriman`.`tanggal`, `pengiriman`.`tanggal_sampai`