app/Models/DashboardModel.php

    public function getDestinasiStats()
    {
        $builder = $this->db->table('pengiriman');
        $builder->select('destinasi.destinasi_name, COUNT(pengiriman.id) as total_destinasi');
        $builder->join('destinasi', 'destinasi.destinasi_id = pengiriman.destinasi_id');
        $builder->groupBy('pengiriman.destinasi_id');
        $builder->orderBy('total_destinasi', 'DESC');
        return $builder->get()->getResult();
---
SELECT `destinasi`.`destinasi_name`, COUNT(pengiriman.id) as total_destinasi
FROM `pengiriman`
JOIN `destinasi` ON `destinasi`.`destinasi_id` = `pengiriman`.`destinasi_id`
GROUP BY `pengiriman`.`destinasi_id`
ORDER BY `total_destinasi` DESC